package gr.aueb.cf.projects;

import java.io.BufferedReader;
import java.io.FileReader;
import java.io.IOException;
import java.util.Arrays;

/**
 * Αναλύει τους χαρακτήρες ενός αρχείου κειμένου και υπολογίζει τη συχνότητα εμφάνισης
 * κάθε γράμματος. Στη συνέχεια, εκτυπώνει τους χαρακτήρες με τη συχνότητά τους σε φθίνουσα σειρά συχνότητας.
 * Η διαδικασία περιλαμβάνει τα εξής βήματα:
 * 1. Ανάγνωση του αρχείου κειμένου "input.txt".
 * 2. Ανάλυση κάθε χαρακτήρα του αρχείου και μέτρηση της συχνότητας εμφάνισης των γραμμάτων.
 * 3. Ταξινόμηση των γραμμάτων με βάση τη συχνότητά τους (από τη μεγαλύτερη προς τη μικρότερη).
 * 4. Εκτύπωση των χαρακτήρων και των συχνοτήτων τους στην οθόνη.
 * Χρησιμοποιεί τον μηχανισμό try-with-resources για την ασφαλή διαχείριση του πόρου BufferedReader,
 * εξασφαλίζοντας ότι το αρχείο θα κλείσει αυτόματα μετά την ανάγνωση.
 * Επιπλέον, το πρόγραμμα υπολογίζει μόνο τη συχνότητα των χαρακτήρων που είναι γράμματα. Άλλοι χαρακτήρες
 * αγνοούνται.
 *
 */


public class CharacterParse {

    public static void main(String[] args) throws IOException {
        // // Ο πίνακας έχει 128 στοιχεία, το πρώτο στοιχείο είναι ο χαρακτήρας και το δεύτερο είναι η συχνότητα.
        int[][] freq = new int[128][2];

        //Αρχικοποίηση του πίνακα με ASCII χαρακτήρες (από 0 έως 127)
        for (int i = 0; i < 128; i++) freq[i][0] = i;

        //try-with-resources για την ασφαλή διαχείριση του BufferedReader
        try (BufferedReader reader = new BufferedReader(new FileReader("input.txt"))) {
            int c;
            // Ανάγνωση κάθε χαρακτήρα του αρχείου & καταμέτρηση της συχνότητας εμαφάνισης στο if
            while ((c = reader.read()) != -1) {
                // Έλεγος αν ο χαρακτήρας είναι γράμμα, οι άλλοι χαρακτήρες παραλείπονται
                if (Character.isLetter(c)) freq[c][1]++;
            }
        }

        // Εκτύπωση των χαρακτήρων με τη συχνότητά τους. Οι χαρακτήρες με μηδενική συχνότητα παραλείπονται
        Arrays.sort(freq, (a, b) -> b[1] - a[1]);
        for (int[] f : freq) {
            if (f[1] > 0) System.out.println((char) f[0] + ": " + f[1]);
        }


    }
}